function repaintProcess(input) {
    let найлон = Number(input[0]);
    let литриБоя = Number(input[1]);
    let литриРазредител = Number(input[2]);
    let часовеРемонт = Number(input[3]);

    let найлонЦена = (найлон + 2) * 1.50;
    let допълнителнаБоя = (литриБоя * 10) / 100;
    let бояЦена = (литриБоя + допълнителнаБоя) * 14.50;
    let разредителЦена = литриРазредител * 5.00;
    let торбички = 0.40;

    let материали = найлонЦена + бояЦена + разредителЦена + торбички;
    let труд = (материали * (30 / 100) * часовеРемонт);

    console.log(материали + труд);


}

repaintProcess(["10", "11", "4", "8"]);