function schoolSupplies(input) {
    let химикали = Number(input[0]);
    let маркери = Number(input[1]);
    let препарат = Number(input[2]);
    let намаление = Number(input[3]) / 100;

    let химикалиЦена = 5.80;
    let маркериЦена = 7.20;
    let препаратЦена = 1.20;

    let купениХимикали = химикали * химикалиЦена;
    let купениМаркери = маркери * маркериЦена;
    let купенПрепарат = препарат * препаратЦена;
    let общоЦена = купениХимикали + купениМаркери + купенПрепарат;
    let общоСледОтстъпка = общоЦена - (общоЦена * намаление);

    console.log(общоСледОтстъпка);
}

schoolSupplies(["2", "3", "4", "25"]);